You have to work on the files:
*  [Books](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Books.csv.gz)
*  [Book ratings](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Book-Ratings.csv.gz)
*  [Users](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Users.csv.gz)
*  [Goodbooks books](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/goodbooks.csv.gz)
*  [Goodbooks ratings](https://github.com/gdv/foundationsCS/raw/master/progetti/2021/goodbooks-ratings.csv.gz)

### Notes

1.    It is mandatory to use GitHub for developing the project.
1.    The project must be a jupyter notebook.
1.    There is no restriction on the libraries that can be used, nor on the Python version.
1.    To read those files, you need to use the `encoding = 'latin-1'` option.
1.    All questions on the project **must** be asked in a public channel on [Zulip](https://focs.zulipchat.com), otherwise no  answer will be given.

In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:90% !important; }</style>"))

In [2]:
import pandas as pd
import numpy as np
import re

### Importo i dataset

Per importare i datafarme con `read_csv` inseriamo tra i parametri il compressore da utilizzare, l'encoding, il separatore e dove necessario l'escape character. Inoltre per alcuni dataset specifichiamo la tipologia degli attributi cosí da velocizzare il caricamento e sistemare eventuali mal interpretazioni. Per il dataset goodbooks utilizziamo `encoding = utf-8` che riesce ad interpretare meglio le stringhe.

In [3]:
users = pd.read_csv('https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Users.csv.gz', compression = 'gzip', escapechar = "\\", encoding = 'latin-1', sep = ';', dtype = {'Age': 'Int64'})
users.shape

(278858, 3)

In [31]:
books = pd.read_csv('https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Books.csv.gz', compression = 'gzip', escapechar = "\\", encoding = 'latin-1', sep = ';')
books.shape

(271359, 8)

In [5]:
goodbooks = pd.read_csv('https://github.com/gdv/foundationsCS/raw/master/progetti/2021/goodbooks.csv.gz', compression = 'gzip', encoding = 'utf-8', sep = ',', dtype = {'isbn13': 'object', 'original_publication_year': 'int64',})
goodbooks.shape

(99, 23)

In [79]:
book_ratings = pd.read_csv('https://github.com/gdv/foundationsCS/raw/master/progetti/2021/Book-Ratings.csv.gz', compression = 'gzip', escapechar = "\\", encoding = 'latin-1', sep = ';')
book_ratings.shape

(1149780, 3)

In [7]:
goodbooks_ratings = pd.read_csv('https://github.com/gdv/foundationsCS/raw/master/progetti/2021/goodbooks-ratings.csv.gz', compression = 'gzip', encoding = 'latin-1', sep = ',')
goodbooks_ratings.shape

(99, 3)

### Verifiche datasets

#### Controllo tipologia di attributi dei dataset

Verifichiamo che le tipologie degli attributi siano quelle che ci aspettiamo.

In [8]:
users.dtypes

User-ID      int64
Location    object
Age          Int64
dtype: object

In [9]:
books.dtypes

ISBN                   object
Book-Title             object
Book-Author            object
Year-Of-Publication     int64
Publisher              object
Image-URL-S            object
Image-URL-M            object
Image-URL-L            object
dtype: object

In [10]:
goodbooks.dtypes

book_id                        int64
goodreads_book_id              int64
best_book_id                   int64
work_id                        int64
books_count                    int64
isbn                          object
isbn13                        object
authors                       object
original_publication_year      int64
original_title                object
title                         object
language_code                 object
average_rating               float64
ratings_count                  int64
work_ratings_count             int64
work_text_reviews_count        int64
ratings_1                      int64
ratings_2                      int64
ratings_3                      int64
ratings_4                      int64
ratings_5                      int64
image_url                     object
small_image_url               object
dtype: object

In [11]:
book_ratings.dtypes

User-ID         int64
ISBN           object
Book-Rating     int64
dtype: object

In [12]:
goodbooks_ratings.dtypes

user_id    int64
book_id    int64
rating     int64
dtype: object

#### Verifico valori anomali

Dato che é richiesto diverse volte di fare merging rispetto agli ISBN decidiamo di verificare la presenza di caratteri speciali in questo attributo dei diversi datasets, per farlo utilizziamo la funzione `contains`. Notiamo che sono presenti molti valori anomali ma decidiamo di non trattarli poiché richiederebbero delle tecniche piú approfondite.

In [81]:
book_ratings[book_ratings['ISBN'].str.contains("\W+", regex = True)]

         User-ID           ISBN  Book-Rating
535       276929  2.02.032126.2            0
536       276929  2.264.03602.8            0
8918      278491    01420.01740           10
9745         183      100940/86            9
9746         183       10622/86            0
...          ...            ...          ...
1145175   275414   "8888809228"            5
1146052   275891    384220/2/52            0
1146054   275891      400/33/72            0
1147650   276009    01400.77022            0
1148549   276331    "0432534220            9

[1163 rows x 3 columns]

In [14]:
books[books['ISBN'].str.contains("\W+", regex = True)]

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
111808,0486404242\t,War in Kind: And Other Poems (Dover Thrift Edi...,Stephen Crane,1998,Dover Publications,http://images.amazon.com/images/P/0486404242.0...,http://images.amazon.com/images/P/0486404242.0...,http://images.amazon.com/images/P/0486404242.0...
171206,3518365479<90,"Suhrkamp TaschenbÃ?ÃÂ¼cher, Nr.47, Frost",Thomas Bernhard,1972,Suhrkamp,http://images.amazon.com/images/P/3518365479.0...,http://images.amazon.com/images/P/3518365479.0...,http://images.amazon.com/images/P/3518365479.0...
251423,3442248027 3,Diamond Age. Die Grenzwelt.,Neal Stephenson,2000,Goldmann,http://images.amazon.com/images/P/3442248027.0...,http://images.amazon.com/images/P/3442248027.0...,http://images.amazon.com/images/P/3442248027.0...
251648,0385722206 0,Balzac and the Little Chinese Seamstress : A N...,DAI SIJIE,2002,Anchor,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...,http://images.amazon.com/images/P/0385722206.0...

In [83]:
goodbooks[goodbooks['isbn'].str.contains("\W+", regex = True)]

Empty DataFrame
Columns: [book_id, goodreads_book_id, best_book_id, work_id, books_count, isbn, isbn13, authors, original_publication_year, original_title, title, language_code, average_rating, ratings_count, work_ratings_count, work_text_reviews_count, ratings_1, ratings_2, ratings_3, ratings_4, ratings_5, image_url, small_image_url, authors_splitted, shared_number_of_reviews_with_a_text]
Index: []

[0 rows x 25 columns]

### 1. Normalize the location field of *Users* dataset, splitting into city, region, country.

Dividiamo la stringa `Location` nelle tre colonne in corrisponzenza delle virgole con la funzione `split` di pandas. Per tentare di risolvere i problemi legati alla presenza di piú di due virgole usiamo la variante `rsplit` che da prioritá al campo `Country`, mentre per quelle stringhe con meno di due virgole specifichiamo `expand = True`.

In [74]:
users[['City', 'Region', 'Country']] = users['Location'].str.rsplit(',', 2, expand=True)
users.head()

,User-ID,Location,Age,City,Region,Country
0,1,"nyc, new york, usa",<NA>,nyc,new york,usa
1,2,"stockton, california, usa",18,stockton,california,usa
2,3,"moscow, yukon territory, russia",<NA>,moscow,yukon territory,russia
3,4,"porto, v.n.gaia, portugal",17,porto,v.n.gaia,portugal
4,5,"farnborough, hants, united kingdom",<NA>,farnborough,hants,united kingdom

Facendo un raggruppamento rispetto a Country ci si rende conto della presenza di valori anomali in alcuni campi e inoltre si notano alcuni problemi con l'encoding, la risoluzione di questi peró esula dalla richiesta principale.

In [85]:
users.groupby('Country').count().head()

                   User-ID  Location   Age  City  Region
Country
                      4588      4588  2000  4588    4588
 "n/a"                   2         2     1     2       2
 &#20013;&#22269;        1         1     1     1       1
 &#32654;&#22269;        1         1     1     1       1
 *                       1         1     0     1       1

### 2. For each book in the *Books* dataset, compute its average rating.

Per prima cosa facciamo una left join delle tabelle `books` e `book_ratings` con la funzione `merge` di pandas. In secondo luogo compiamo un raggruppamento rispetto al campo `ISBN` facendo la media del campo `Book-Rating`.

In [100]:
books_avg = pd.merge(books, book_ratings, on = 'ISBN', how = 'left').groupby(['Book-Title', 'ISBN'], as_index=False).agg(Book_Average_Rating = ('Book-Rating', 'mean'))
books_avg.head()

,Book-Title,ISBN,Book_Average_Rating
0,A Light in the Storm: The Civil War Diary of ...,0590567330,2.25
1,Always Have Popsicles,0964147726,0.00
2,Apple Magic (The Collector's series),0942320093,0.00
3,"Ask Lily (Young Women of Faith: Lily Series, ...",0310232546,8.00
4,Beyond IBM: Leadership Marketing and Finance ...,0962295701,0.00

### 3. For each book in the *GoodBooks* dataset, compute its average rating.

Per risolvere questo quesito abbiamo sfruttato la colonna `average_rating` giá presente nel dataset goodbooks.

In [18]:
goodbooks[['isbn', 'original_title', 'average_rating']].head()

        isbn                            original_title  average_rating
0  439023483                          The Hunger Games            4.34
1  439554934  Harry Potter and the Philosopher's Stone            4.44
2  316015849                                  Twilight            3.57
3   61120081                     To Kill a Mockingbird            4.25
4  743273567                          The Great Gatsby            3.89

### 4. Merge together all rows sharing the same book title, author and publisher. We will call the resulting datset `merged books`. The books that have not been merged together will not appear in `merged books`.

In un primo momento creiamo il dataset `merging_books`, che sfrutteró anche nel punto successivo, con presenti tutte le righe che si ripetono almeno una volta rispetto ai campi `Book-Title`, `Book-Author` e `Publisher`. Per farlo utilizziamo la funzione `duplicated` con `keep = False` che restituisce un array di booleani. 
Successivamente creiamo il dataset `merged_books` raggruppando il dataset precedente rispetto a `Book-Title`, `Book-Author` e `Publisher` e otteniamo la colonna `Count`.

In [86]:
merging_books = books[books.duplicated(subset = ['Book-Title', 'Book-Author', 'Publisher'], keep = False)]
merged_books = merging_books.groupby(['Book-Title', 'Book-Author', 'Publisher'], as_index=False).agg(Count=('ISBN', 'count'))
merged_books.head()

,Book-Title,Book-Author,Publisher,Count
0,!%@ (A Nutshell handbook),Donnalyn Frey,O'Reilly,2
1,'A Hell of a Place to Lose a Cow': An American...,Tim Brookes,National Geographic,2
2,"10,000 dreams interpreted: A dictionary of dreams",Gustavus Hindman Miller,Barnes &amp; Nobles Books,2
3,101 Famous Poems,Roy J. Cook,McGraw-Hill/Contemporary Books,3
4,15 Houseplants Even You Can't Kill,Joe Elder,Berkley Pub Group,2

### 5. For each book in `merged books` compute its average rating.

Calcolo l'Average_Rating per ogni edizione dei libri in book_ratings e poi faccio un merge con il dataset creato al punto precedente.

In [106]:
temp = book_ratings.groupby('ISBN').agg(Average_Rating = ('Book-Rating', 'mean'))
merging_book_ratings = pd.merge(merging_books, temp, on = 'ISBN', how = 'left').sort_values(['Book-Title', 'Book-Author', 'Publisher'])
merging_book_ratings.groupby('Book-Title', as_index=False)[['Average_Rating']].mean().head()

                                          Book-Title  Average_Rating
0                          !%@ (A Nutshell handbook)        3.000000
1  'A Hell of a Place to Lose a Cow': An American...        1.700000
2  10,000 dreams interpreted: A dictionary of dreams        6.958333
3                                   101 Famous Poems        3.111111
4                 15 Houseplants Even You Can't Kill        0.000000

### 6. For each book in `merged books` compute the minimum and maximum of the average ratings over all corresponding books in the `books` dataset.

Hence for each book in `merged books` we will have exactly two values (a minimum and a maximum)

In [21]:
merging_book_ratings.groupby(['Book-Title', 'Book-Author', 'Publisher'], as_index=False).agg({'Average_Rating' : ['min', 'max']}).head()

                                          Book-Title              Book-Author  \

0                          !%@ (A Nutshell handbook)            Donnalyn Frey
1  'A Hell of a Place to Lose a Cow': An American...              Tim Brookes
2  10,000 dreams interpreted: A dictionary of dreams  Gustavus Hindman Miller
3                                   101 Famous Poems              Roy J. Cook
4                 15 Houseplants Even You Can't Kill                Joe Elder

                        Publisher Average_Rating
                                             min   max
0                        O'Reilly       0.000000  6.00
1             National Geographic       0.000000  3.40
2       Barnes &amp; Nobles Books       6.666667  7.25
3  McGraw-Hill/Contemporary Books       0.000000  5.00
4               Berkley Pub Group       0.000000  0.00

Sfruttando il dataset del punto precedente facciamo un groupby e calcoliamo max e min del valore medio con la funzione agg

### 7. For each book in `goodbooks`, compute the list of its authors. Assuming that the number of reviews with a text (column `work_text_reviews_count`) is split equally among all authors, find for each authors the total number of reviews with a text. We will call this quantity the *shared number of reviews with a text*.

Creiamo una nuova colonna chiamata authors_splitted, ottenuta con la funzione split, che contiene gli autori come lista per ogni libro.
Aggiungiamo poi la colonna shared_number_of_reviews_with_a_text calcolata dividendo work_text_reviews_count per in numero di autori di ogni libro (lunghezza della lista splitted_authors).

Costruiamo poi un nuovo dataset con una riga per ogni coppia libro-autore della lista splitted_authors. Infine facciamo un group by e una sum rispetto ad ogni attore per ottenere il shared_number_of_reviews_with_a_text di ogni scrittore.

In [122]:
goodbooks['authors_splitted'] = goodbooks['authors'].str.split(',')
goodbooks['shared_number_of_reviews_with_a_text'] = goodbooks['work_text_reviews_count'] / goodbooks['authors_splitted'].apply(len)

pd.set_option('display.max_rows', 500)

goodbooks_exploded = goodbooks.explode('authors_splitted')
#goodbooks_exploded['authors_splitted'] = goodbooks_exploded['authors_splitted'].str.strip()
goodbooks_exploded.groupby(['authors_splitted'], as_index=False)['shared_number_of_reviews_with_a_text'].sum()

                authors_splitted  shared_number_of_reviews_with_a_text
0                 Alan R. Clarke                          27890.500000
1        B.M. Mooyaart-Doubleday                           6941.666667
2                   Bernard Knox                           1620.200000
3                    Celâl Üster                          15172.666667
4                  David J. Skal                           5754.333333
5             Dom Marcos Barbosa                           6134.250000
6                      E.V. Rieu                           1620.200000
7              Eleanor Roosevelt                           6941.666667
8                    Erich Fromm                          15172.666667
9                Frédéric Mugler                           1620.200000
10                Garth Williams                           4348.000000
11               Gregory Rabassa                          10835.500000
12                  Guy Cardwell                           4149.333333
13          Hablot Knight Browne                           4364.333333
14             Jeffrey Eugenides                           9823.500000
15                   John Seelye                           4149.333333
16                  Louis Sachar                           7916.000000
17                 Marion Wiesel                          11000.500000
18                 Mary GrandPré                         136668.000000
19                Maurice Hindle                           6664.333333
20              Melina Karakosta                           6134.250000
21                 Michael Mason                          15606.000000
22                 Nina Auerbach                           5754.333333
23          Percy Bysshe Shelley                           6664.333333
24                   Reg Keeland                          46983.000000
25                Richard Howard                           6134.250000
26               Richard J. Dunn                          13078.500000
27               Richard Maxwell                           4364.333333
28      Robert           Jackson                           7389.000000
29                 Robert Fagles                           1620.200000
30                 Ros Ballaster                           3842.000000
31                Rosemary Wells                           4348.000000
32                    Rufus Beck                          12033.000000
33             Stephen J. Dubner                           6834.000000
34                   Tony Tanner                           3842.000000
35                 Aldous Huxley                          20095.000000
36                  Alice Sebold                          36642.000000
37                    Anne Frank                           6941.666667
38      Antoine de Saint-Exupéry                           6134.250000
39                 Arthur Golden                          25605.000000
40            Audrey Niffenegger                          43382.000000
41                   Bram Stoker                           5754.333333
42                    C.S. Lewis                          15186.000000
43               Cassandra Clare                          51589.000000
44               Charles Dickens                           4364.333333
45              Charlotte Brontë                          15606.000000
46           Christopher Paolini                          18280.000000
47                     Dan Brown                          66672.000000
48                 Douglas Adams                          20345.000000
49                    E.B. White                           4348.000000
50                    E.L. James                         128776.000000
51                   Elie Wiesel                          11000.500000
52             Elizabeth Gilbert                          49714.000000
53                  Emily Brontë                          13078.500000
54           F. Scott Fitzgerald                          51992.000000
55       Frances Hodgson Burnett                          13054.000000
56        Gabriel García Márquez                          10835.500000
57                 George Orwell                          50644.666667
58            George R.R. Martin                          46205.000000
59                 Gillian Flynn                         121614.000000
60                    Harper Lee                          72586.000000
61                Helen Fielding                           8157.000000
62                         Homer                           1620.200000
63                 J.D. Salinger                          44920.000000
64                  J.K. Rowling                         136668.000000
65                J.R.R. Tolkien                          52986.000000
66                 James Dashner                          48942.000000
67                   Jane Austen                          52994.000000
68               Jeannette Walls                          40777.000000
69                  Jodi Picoult                          30719.000000
70                    John Green                         230584.000000
71                  John Grisham                           4239.000000
72                John Steinbeck                          24642.000000
73                  Jon Krakauer                          17299.000000
74              Kathryn Stockett                          78204.000000
75               Khaled Hosseini                         103375.000000
76             Kurt Vonnegut Jr.                          19646.000000
77             Lauren Weisberger                           8024.000000
78                    Lois Lowry                          54084.000000
79                  Louis Sachar                           7916.000000
80             Louisa May Alcott                          17090.000000
81             Margaret Mitchell                          16050.000000
82                   Mark Haddon                          35796.000000
83                    Mark Twain                           4149.333333
84                  Markus Zusak                          93611.000000
85   Mary Wollstonecraft Shelley                           6664.333333
86              Michael Crichton                           8143.000000
87               Nicholas Sparks                          17279.000000
88              Orson Scott Card                          38054.000000
89                   Oscar Wilde                           9823.500000
90                 Paula Hawkins                          93600.000000
91                  Paulo Coelho                          27890.500000
92                Philip Pullman                          14915.000000
93                  Ray Bradbury                          30694.000000
94                  Rick Riordan                          46006.000000
95                   S.E. Hinton                          22662.000000
96                    Sara Gruen                          55732.000000
97              Shel Silverstein                          23602.000000
98               Stephen Chbosky                          47116.000000
99                  Stephen King                          14936.000000
100              Stephenie Meyer                         258573.000000
101             Steven D. Levitt                           6834.000000
102                Stieg Larsson                          46983.000000
103                Sue Monk Kidd                          26522.000000
104              Suzanne Collins                         340066.000000
105                Veronica Roth                         156896.000000
106              William Golding                          26886.000000
107              William Goldman                          15630.000000
108          William Shakespeare                           7389.000000
109                  Yann Martel                          42962.000000

### 8. For each year of publication, determine the author that has the largest value of the shared number of reviews with a text.

Da spiegare bene..

Infine creo un altro dataset temporaneo chiamato authors_highest_reviews cosí da poter usare set_index per avere una vista piu compatta per gli anni con autori a pari merito.

In [23]:
temp = goodbooks_exploded.groupby(['original_publication_year', 'authors_splitted'], as_index=False).sum()
idx = temp.groupby(['original_publication_year'])['shared_number_of_reviews_with_a_text'].transform(max) == temp['shared_number_of_reviews_with_a_text']

authors_highest_reviews = temp[idx] [['original_publication_year', 'shared_number_of_reviews_with_a_text', 'authors_splitted']]
authors_highest_reviews.set_index(['original_publication_year', 'shared_number_of_reviews_with_a_text', 'authors_splitted']).head(10)

Empty DataFrame
Columns: []
Index: [(-720, 1620.2,  Bernard Knox), (-720, 1620.2,  E.V. Rieu), (-720, 1620.2,  Frédéric Mugler), (-720, 1620.2,  Robert Fagles), (-720, 1620.2, Homer), (1595, 7389.0,  Robert           Jackson), (1595, 7389.0, William Shakespeare), (1811, 3842.0,  Ros Ballaster), (1811, 3842.0,  Tony Tanner), (1811, 3842.0, Jane Austen)]

### 9. Assuming that there are no errors in the ISBN fields, find the books in both datasets, and compute the difference of average rating according to the ratings and the goodratings datasets

Scalo i voti del dataset Books perché in scala 10

In [24]:
books_goodbooks = pd.merge(books_avg, goodbooks, left_on = 'ISBN', right_on = 'isbn')

books_goodbooks['Book_Average_Rating'] = books_goodbooks['Book_Average_Rating'] / 2
books_goodbooks['Difference'] = books_goodbooks['Book_Average_Rating'] - books_goodbooks['average_rating']

books_goodbooks.rename(columns={'average_rating': 'Goodbook_Average_Rating'}, inplace=True)
books_goodbooks[['ISBN', 'Book-Title', 'Book_Average_Rating', 'Goodbook_Average_Rating', 'Difference']]

,ISBN,Book-Title,Book_Average_Rating,Goodbook_Average_Rating,Difference
0,014028009X,Bridget Jones's Diary,1.875926,3.75,-1.874074
1,043965548X,Harry Potter and the Prisoner of Azkaban (Harr...,1.766667,4.53,-2.763333
2,1400032717,The Curious Incident of the Dog in the Night-T...,2.406593,3.85,-1.443407
3,1594480001,The Kite Runner,1.200000,4.26,-3.060000
4,014038572X,The Outsiders (Now in Speak!),2.230337,4.06,-1.829663

### 10. Split the users dataset according to the age. One dataset contains the users with unknown age, one with age 0-14, one with age 15-24, one with age 25-34, and so on.

In [25]:
users.groupby(pd.cut(users['Age'], np.arange(14, 150, 10)), as_index=False).count()

    User-ID  Location    Age   City  Region  Country
0     40001     40001  40001  40001   40001    40001
1     50767     50767  50767  50767   50766    50766
2     32690     32690  32690  32690   32690    32690
3     23152     23152  23152  23152   23152    23152
4     12493     12493  12493  12493   12493    12493
5      3596      3596   3596   3596    3596     3595
6       615       615    615    615     615      615
7        83        83     83     83      83       83
8       278       278    278    278     278      278
9        20        20     20     20      20       20
10       23        23     23     23      23       23
11        5         5      5      5       5        5
12        9         9      9      9       9        9

In [26]:
interval = np.arange(14,95,10)
grouped_users=list(range(len(interval)))
grouped_users[0]=users[users["Age"]<=14][["User-ID","Age"]]
grouped_users[len(interval)-1]=users[users["Age"].isnull()][["User-ID","Age"]]
for i in range(1,len(interval)-1): #va da 1 a 7
    s=users[(users["Age"]>interval[i])&(users["Age"]<=interval[i+1])][["User-ID","Age"]]
    grouped_users[i]=s

grouped_users[2].head()

    User-ID  Age
53       54   44
66       67   43
69       70   44
74       75   37
84       85   41

### 11. Find the books that appear only in the goodbooks datasets.

In [27]:
goodbooks[~goodbooks['isbn'].isin(books_goodbooks['ISBN'])].head() [['isbn', 'original_title']]

        isbn                            original_title
0  439023483                          The Hunger Games
1  439554934  Harry Potter and the Philosopher's Stone
2  316015849                                  Twilight
3   61120081                     To Kill a Mockingbird
4  743273567                          The Great Gatsby

### 12. Assuming that each pair (author, title) identifies a book, for each book find the number of times it appears in the books dataset. Which books appear the most times?

In [28]:
books_grouped = books.groupby(['Book-Title', 'Book-Author'], as_index=False)['ISBN'].count()
books_grouped.rename(columns={'ISBN':'Count'}, inplace=True)
books_grouped.head()

                                          Book-Title       Book-Author  Count
0   A Light in the Storm: The Civil War Diary of ...       Karen Hesse      1
1                              Always Have Popsicles    Rebecca Harvin      1
2               Apple Magic (The Collector's series)  Martina Boudreau      1
3   Ask Lily (Young Women of Faith: Lily Series, ...      Nancy N. Rue      1
4   Beyond IBM: Leadership Marketing and Finance ...        Lou Mobley      1

In [29]:
books_grouped[books_grouped['Count'] == books_grouped['Count'].max()]

          Book-Title        Book-Author  Count
114024  Little Women  Louisa May Alcott     21

### 13. Find the author with the highest average rating according to the goodbooks datasets.

In [30]:
temp = goodbooks_exploded.groupby('authors_splitted', as_index=False)['average_rating'].mean()
temp[temp['average_rating'] == temp['average_rating'].max()]

   authors_splitted  average_rating
32       Rufus Beck            4.53